Revit 2026 API

# SketchedStairsCurveData Properties

---

The SketchedStairsCurveData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

SketchedStairsCurveData Class

Autodesk.Revit.DB Namespace